Tekla Open API Reference for Tekla Structures 2025
ModelHandler.Open Method
Opens a new model to Tekla Structures without saving changes to current model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Open(
	string ModelFolder,
	bool OpenAutoSaved = false
)
Public Function Open (
	ModelFolder As String,
	Optional OpenAutoSaved As Boolean = false
) As Boolean
Parameters
ModelFolder
Type: System.String
The model folder path to be used.
OpenAutoSaved (Optional)
Type: System.Boolean
Tells whether to open auto saved information or not. Optional parameter, default = false
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace